from nltk.chat.util import Chat, reflections

pairs = [
    [
        r"my name is (.*)",
        ["%1 राव, कसंकाय, बरं हाय न्हवं ?\n",]
    ],
    [
        r"hi|hey|hello",
        ["नमस्कार…\n", "राम राम\n",]
    ], 
    [
        r"what is your name ?",
        ["सरपंच! सरपंच म्हंत्यात आम्हासनी…\n",]
    ],
    [
        r"how are you ?",
        ["मी निवांत .\nतुम्ही ?\n",]
    ],
    [
        r"sorry (.*)",
        ["सोडा त्यो इषय…\n","असुद्या हो, काही नाही इतकं…\n",]
    ],
    [
        r"I am fine",
        ["हे बेस झालं, बोला काय म्हणता ?\n",]
    ],
    [
        r"(.*)good",
        ["बरंय !\n"]
    ],
    [
        r"i'm (.*) doing good",
        ["ऎकून बरं वाटंल.\n","कशी मदत करु शकतो आपली ? :)\n",]
    ],
    [
        r"(.*) age?",
        ["सावकार, आमचं वय इचारत नस्त्यात…\n",]
    ],
    [
        r"what (.*) want ?",
        ["असं म्हंता, सोईचं बघा कायतर… ;)\n",]
    ],
    [
        r"(.*) created ?",
        ["शिक्रेट हाय! ;)\n",]
    ],
    [
        r"(.*) (location|city)(.*)?",
        ['हे कोल्हापूर हाय ओ.\n',]
    ],
    [
        r"how is weather in (.*)?",
        ["वारं सुटलंय सुसाट!\n","किती उकडतंय !\n","थंडी पडलीया…\n","कधी उन्ह कधी पाऊस, काय अंदाज इना ओ!\n"]
    ],
    [
        r"(.*) work in (.*)",
        ["म्हंजी यावेळी देणगी रग्गड मिळनार म्हना की…\n",]
    ],
    [
        r"(.*)raining in (.*)?",
        ["पाऊस काय पडला नाही बघा…\n","इकडं लयं पाऊस पडतोय!\n"]
    ],
    [
        r"how (.*) health(.*)",
        ["आम्ही प्रोग्राम हाय ओ. कायम निवांत !\n",]
    ],
    [
        r"(.*) (sports|game) ?",
        ["मला कुस्ती लय आवडती बघा .\n"]
    ],
    [
        r"(.*) (sportsperson|player) ?",
        ["खाशाबा जाधव हुते बघा जबरी पैलवान…\n"]
    ],
    [
        r"(.*) (moviestar|actor)?",
        ["अशोक सराफ आवडतोय मला ;{\n","दादा कोंडके ;)\n","निळू फुले :{\n","लक्ष्या मामा :}\n","उषा चव्हाण\n","रंजना देशमुख\n"]
    ],
    [
        r"suggest me some courses?",
        ["गूगल वर जावा, सगळं भेटतंय बघा तिथं.\n"]
    ],
    [
        r"quit",
        ["पुन्हा भेटू.\n","बरं वाटलं बघा बोलून !\n"]
    ],
    [
        r"(.*)",
        ["काय कळलं नाय ओ, काय म्हनायचंय ते…\n"]
    ],

]

def chat():
    print("\n\nरामराम पावनं ! मी सरपंच. कायकाय आणि?\n")
    chat = Chat(pairs, reflections)
    chat.converse()

chat()
